controllers/CourseController.php

SELECT * FROM "course" WHERE "id"='1'
---
    protected function findModel($id)
    {
        if (($model = Course::findOne($id)) !== null) {