controllers/CourseController.php

SELECT * FROM "registers" WHERE "student"=6
SELECT * FROM "page" WHERE "course_site"=1
---
    public function actionIndex($id)
    {
        $edition = CourseSite:: findCurrentCourseSite($id);
        // check if user is subscribed to that course site
        $subscribed = false;
        $register = Registers::find()->where(['student' => Yii::$app->user->id])->one();
        if($register)
            $subscribed=true;
        return $this->render('index', [
            'model' => $this->findModel($id),
            'edition' => $edition,
            'pages' => $edition->getPages()->all(),
            'subscribed' => $subscribed
        ]);

SELECT * FROM "course_site" WHERE "course"=1
---
    public function actionSites($id)
    {
        $model = $this->findModel($id);
        return $this->render('sites', [
            'model' => $model,
            'courses' => $model->getCourseSites()->all()
        ]);

SELECT * FROM "course" WHERE "id"='1'
---
    protected function findModel($id)
    {
        if (($model = Course::findOne($id)) !== null) {