controllers/SiteController.php

INSERT INTO "usertemp" ("username", "timestamp") VALUES ('silvana.castano@di.unimi.it', 1568290073)
---
    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post())) {
			switch($model->login()){
				case 0:
					$model->password = '';
					return $this->render('login', [
						'model' => $model,
						]);
					break;
				case 1:
					return $this->roleBasedHomePage();  // render della landing page in base al ruolo
					break;
				case 100:
				// conservo username e password del form di login
					// Salvataggio dei dati nella tabella temporanea
					$temp = new Usertemp();
					$temp->setUsername($model->username);
					$temp->save();

SELECT * FROM "student" WHERE "id"=5
SELECT * FROM "course_site"
SELECT * FROM "course_site" WHERE "id" IN (1, 3, 5)
SELECT * FROM "registers" WHERE "student"=5
SELECT * FROM "course_site" WHERE "id" IN (1, 3, 5, 10)
---
	public function actionStudenthome()
    {
        $subscribed = true;
        $model = new Registers();
        if ($course = Yii::$app->request->post('submit')){
            $model->student = \Yii::$app->user->identity->id;
            $model->course_site = $course;
            $model->date =  new \yii\db\Expression('NOW()'); // change with actual data
            $model->save();
            \Yii::$app->getSession()->setFlash('success', 'Ti sei iscritto al corso!');
            return $this->redirect(['studenthome']);
        }
        $student = Student::findOne(\Yii::$app->user->identity->id);
        $allcourses = CourseSite::find()->all();
		return $this->render('studenthome', [
		    'student' => $student,
            'courses' => $student->getCourseSites()->all(),
            'allcourses' => $allcourses,
            'model' => $model
				]);