models/CourseSite.php

SELECT * FROM "course_site" WHERE ("course"='1') AND ("is_current"=TRUE)
---
    public static function findCurrentCourseSite($course)
    {
        return static::findOne(['course' => $course, 'is_current' => true]);		// 'is_disabled' => 0

SELECT * FROM "course_site" WHERE "id"='1'
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);		// 'is_disabled' => 0