models/User.php

SELECT * FROM "user" WHERE "id"=3
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);		// 'is_disabled' => 0

SELECT * FROM "user" WHERE "username"='silvana.castano@di.unimi.it'
---
    public static function findByUsername($username)
    {
		return static::findOne(['username' => $username]); 					// 'is_disabled' => false